applications/test/gaussLaplacian_inplace/cases/v2406/pitzDaily/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

GradScheme  fusedGauss;
//GradScheme  Gauss;


gradSchemes
{
    default         ${GradScheme} linear;
}

divSchemes
{
    default         none;

    div(phi,U)      ${GradScheme} linearUpwind grad(U);

    turbulence      ${GradScheme} upwind;
    div(phi,k)      $turbulence;
    div(phi,epsilon) $turbulence;
    div(phi,nuTilda) $turbulence;
    div(phi,R)      $turbulence;
    div(R)          ${GradScheme} linear;

    div((nuEff*dev2(T(grad(U))))) ${GradScheme} linear;
}

laplacianSchemes
{
    default         ${GradScheme} linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
